SensorLogicInc/modules/slmx4_projects/vcom_xep_matlab_server/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_B1_15 (coord B14), FACRESET_BUTTON */
#define BOARD_INITPINS_FACRESET_BUTTON_GPIO                                GPIO7   /*!< GPIO device name: GPIO7 */
#define BOARD_INITPINS_FACRESET_BUTTON_PORT                                GPIO7   /*!< PORT device name: GPIO7 */
#define BOARD_INITPINS_FACRESET_BUTTON_PIN                                   31U   /*!< GPIO7 pin index: 31 */

/* GPIO_AD_B0_00 (coord M14), SLEEPAIR_BUTTON */
#define BOARD_INITPINS_SLEEPAIR_BUTTON_GPIO                                GPIO6   /*!< GPIO device name: GPIO6 */
#define BOARD_INITPINS_SLEEPAIR_BUTTON_PORT                                GPIO6   /*!< PORT device name: GPIO6 */
#define BOARD_INITPINS_SLEEPAIR_BUTTON_PIN                                    0U   /*!< GPIO6 pin index: 0 */

/* GPIO_B1_13 (coord D14), WDOG */
#define BOARD_INITPINS_WDOG_GPIO                                           GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_WDOG_PORT                                           GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_WDOG_PIN                                              29U   /*!< GPIO2 pin index: 29 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_EMC_10 (coord G1), ADDR01 */
#define BOARD_INIT_SDRAM_ADDR01_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_ADDR01_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INIT_SDRAM_ADDR01_CHANNEL                                       1U   /*!< SEMC ADDR channel: 01 */

/* GPIO_EMC_11 (coord G3), ADDR02 */
#define BOARD_INIT_SDRAM_ADDR02_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_ADDR02_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INIT_SDRAM_ADDR02_CHANNEL                                       2U   /*!< SEMC ADDR channel: 02 */

/* GPIO_EMC_12 (coord H1), ADDR03 */
#define BOARD_INIT_SDRAM_ADDR03_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_ADDR03_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INIT_SDRAM_ADDR03_CHANNEL                                       3U   /*!< SEMC ADDR channel: 03 */

/* GPIO_EMC_13 (coord A6), ADDR04 */
#define BOARD_INIT_SDRAM_ADDR04_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_ADDR04_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INIT_SDRAM_ADDR04_CHANNEL                                       4U   /*!< SEMC ADDR channel: 04 */

/* GPIO_EMC_14 (coord B6), ADDR05 */
#define BOARD_INIT_SDRAM_ADDR05_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_ADDR05_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INIT_SDRAM_ADDR05_CHANNEL                                       5U   /*!< SEMC ADDR channel: 05 */

/* GPIO_EMC_15 (coord B1), ADDR06 */
#define BOARD_INIT_SDRAM_ADDR06_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_ADDR06_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INIT_SDRAM_ADDR06_CHANNEL                                       6U   /*!< SEMC ADDR channel: 06 */

/* GPIO_EMC_16 (coord A5), ADDR07 */
#define BOARD_INIT_SDRAM_ADDR07_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_ADDR07_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INIT_SDRAM_ADDR07_CHANNEL                                       7U   /*!< SEMC ADDR channel: 07 */

/* GPIO_EMC_17 (coord A4), ADDR08 */
#define BOARD_INIT_SDRAM_ADDR08_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_ADDR08_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INIT_SDRAM_ADDR08_CHANNEL                                       8U   /*!< SEMC ADDR channel: 08 */

/* GPIO_EMC_18 (coord B2), ADDR09 */
#define BOARD_INIT_SDRAM_ADDR09_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_ADDR09_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INIT_SDRAM_ADDR09_CHANNEL                                       9U   /*!< SEMC ADDR channel: 09 */

/* GPIO_EMC_23 (coord G2), ADDR10 */
#define BOARD_INIT_SDRAM_ADDR10_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_ADDR10_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INIT_SDRAM_ADDR10_CHANNEL                                      10U   /*!< SEMC ADDR channel: 10 */

