SensorLogicInc/modules/slmx4_projects/vcom_xep_matlab_server/board/pin_mux.h
/* GPIO_EMC_19 (coord B4), ADDR11 */
#define BOARD_INIT_SDRAM_ADDR11_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_ADDR11_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INIT_SDRAM_ADDR11_CHANNEL                                      11U   /*!< SEMC ADDR channel: 11 */

/* GPIO_EMC_21 (coord C1), BA0 */
#define BOARD_INIT_SDRAM_BA0_PERIPHERAL                                     SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_BA0_SIGNAL                                           BA   /*!< SEMC signal: BA */
#define BOARD_INIT_SDRAM_BA0_CHANNEL                                          0U   /*!< SEMC BA channel: 0 */

/* GPIO_EMC_22 (coord F1), BA1 */
#define BOARD_INIT_SDRAM_BA1_PERIPHERAL                                     SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_BA1_SIGNAL                                           BA   /*!< SEMC signal: BA */
#define BOARD_INIT_SDRAM_BA1_CHANNEL                                          1U   /*!< SEMC BA channel: 1 */

/* GPIO_EMC_24 (coord D3), CAS */
#define BOARD_INIT_SDRAM_CAS_PERIPHERAL                                     SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_CAS_SIGNAL                                     semc_cas   /*!< SEMC signal: semc_cas */

/* GPIO_EMC_27 (coord A2), CKE */
#define BOARD_INIT_SDRAM_CKE_PERIPHERAL                                     SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_CKE_SIGNAL                                     semc_cke   /*!< SEMC signal: semc_cke */

/* GPIO_EMC_26 (coord B3), CLK */
#define BOARD_INIT_SDRAM_CLK_PERIPHERAL                                     SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_CLK_SIGNAL                                     semc_clk   /*!< SEMC signal: semc_clk */

/* GPIO_EMC_25 (coord D2), RAS */
#define BOARD_INIT_SDRAM_RAS_PERIPHERAL                                     SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_RAS_SIGNAL                                     semc_ras   /*!< SEMC signal: semc_ras */

/* GPIO_EMC_28 (coord D1), WE */
#define BOARD_INIT_SDRAM_WE_PERIPHERAL                                      SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_WE_SIGNAL                                       semc_we   /*!< SEMC signal: semc_we */

/* GPIO_EMC_29 (coord E1), CS */
#define BOARD_INIT_SDRAM_CS_PERIPHERAL                                      SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_CS_SIGNAL                                            CS   /*!< SEMC signal: CS */
#define BOARD_INIT_SDRAM_CS_CHANNEL                                           0U   /*!< SEMC CS channel: 0 */

/* GPIO_EMC_37 (coord E4), DATA15 */
#define BOARD_INIT_SDRAM_DATA15_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA15_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA15_CHANNEL                                      15U   /*!< SEMC DATA channel: 15 */

/* GPIO_EMC_36 (coord C3), DATA14 */
#define BOARD_INIT_SDRAM_DATA14_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA14_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA14_CHANNEL                                      14U   /*!< SEMC DATA channel: 14 */

/* GPIO_EMC_35 (coord E5), DATA13 */
#define BOARD_INIT_SDRAM_DATA13_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA13_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA13_CHANNEL                                      13U   /*!< SEMC DATA channel: 13 */

/* GPIO_EMC_34 (coord D4), DATA12 */
#define BOARD_INIT_SDRAM_DATA12_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA12_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA12_CHANNEL                                      12U   /*!< SEMC DATA channel: 12 */

/* GPIO_EMC_00 (coord E3), DATA00 */
#define BOARD_INIT_SDRAM_DATA00_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA00_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA00_CHANNEL                                       0U   /*!< SEMC DATA channel: 00 */

/* GPIO_EMC_01 (coord F3), DATA01 */
#define BOARD_INIT_SDRAM_DATA01_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA01_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA01_CHANNEL                                       1U   /*!< SEMC DATA channel: 01 */

/* GPIO_EMC_03 (coord G4), DATA03 */
#define BOARD_INIT_SDRAM_DATA03_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA03_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA03_CHANNEL                                       3U   /*!< SEMC DATA channel: 03 */

/* GPIO_EMC_02 (coord F4), DATA02 */
#define BOARD_INIT_SDRAM_DATA02_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA02_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA02_CHANNEL                                       2U   /*!< SEMC DATA channel: 02 */

/* GPIO_EMC_04 (coord F2), DATA04 */
#define BOARD_INIT_SDRAM_DATA04_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA04_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA04_CHANNEL                                       4U   /*!< SEMC DATA channel: 04 */

/* GPIO_EMC_05 (coord G5), DATA05 */
#define BOARD_INIT_SDRAM_DATA05_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA05_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA05_CHANNEL                                       5U   /*!< SEMC DATA channel: 05 */

