SensorLogicInc/modules/slmx4_projects/vcom_xep_matlab_server/board/pin_mux.h
/* GPIO_EMC_06 (coord H5), DATA06 */
#define BOARD_INIT_SDRAM_DATA06_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA06_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA06_CHANNEL                                       6U   /*!< SEMC DATA channel: 06 */

/* GPIO_EMC_07 (coord H4), DATA07 */
#define BOARD_INIT_SDRAM_DATA07_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA07_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA07_CHANNEL                                       7U   /*!< SEMC DATA channel: 07 */

/* GPIO_EMC_30 (coord C6), DATA08 */
#define BOARD_INIT_SDRAM_DATA08_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA08_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA08_CHANNEL                                       8U   /*!< SEMC DATA channel: 08 */

/* GPIO_EMC_31 (coord C5), DATA09 */
#define BOARD_INIT_SDRAM_DATA09_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA09_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA09_CHANNEL                                       9U   /*!< SEMC DATA channel: 09 */

/* GPIO_EMC_32 (coord D5), DATA10 */
#define BOARD_INIT_SDRAM_DATA10_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA10_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA10_CHANNEL                                      10U   /*!< SEMC DATA channel: 10 */

/* GPIO_EMC_33 (coord C4), DATA11 */
#define BOARD_INIT_SDRAM_DATA11_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DATA11_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INIT_SDRAM_DATA11_CHANNEL                                      11U   /*!< SEMC DATA channel: 11 */

/* GPIO_EMC_08 (coord H3), DM0 */
#define BOARD_INIT_SDRAM_DM0_PERIPHERAL                                     SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DM0_SIGNAL                                           DM   /*!< SEMC signal: DM */
#define BOARD_INIT_SDRAM_DM0_CHANNEL                                          0U   /*!< SEMC DM channel: 0 */

/* GPIO_EMC_38 (coord D6), DM1 */
#define BOARD_INIT_SDRAM_DM1_PERIPHERAL                                     SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DM1_SIGNAL                                           DM   /*!< SEMC signal: DM */
#define BOARD_INIT_SDRAM_DM1_CHANNEL                                          1U   /*!< SEMC DM channel: 1 */

/* GPIO_EMC_09 (coord C2), ADDR00 */
#define BOARD_INIT_SDRAM_ADDR00_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_ADDR00_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INIT_SDRAM_ADDR00_CHANNEL                                       0U   /*!< SEMC ADDR channel: 00 */

/* GPIO_EMC_39 (coord B7), DQS */
#define BOARD_INIT_SDRAM_DQS_PERIPHERAL                                     SEMC   /*!< Device name: SEMC */
#define BOARD_INIT_SDRAM_DQS_SIGNAL                                     semc_dqs   /*!< SEMC signal: semc_dqs */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_SDRAM(void);

/* GPIO_SD_B1_08 (coord P3), IO0 */
#define BOARD_INIT_FLASH_IO0_PERIPHERAL                                  FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INIT_FLASH_IO0_SIGNAL                              FLEXSPI_A_DATA0   /*!< FLEXSPI signal: FLEXSPI_A_DATA0 */

/* GPIO_SD_B1_09 (coord N4), IO1 */
#define BOARD_INIT_FLASH_IO1_PERIPHERAL                                  FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INIT_FLASH_IO1_SIGNAL                              FLEXSPI_A_DATA1   /*!< FLEXSPI signal: FLEXSPI_A_DATA1 */

/* GPIO_SD_B1_10 (coord P4), IO2 */
#define BOARD_INIT_FLASH_IO2_PERIPHERAL                                  FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INIT_FLASH_IO2_SIGNAL                              FLEXSPI_A_DATA2   /*!< FLEXSPI signal: FLEXSPI_A_DATA2 */

/* GPIO_SD_B1_11 (coord P5), IO3 */
#define BOARD_INIT_FLASH_IO3_PERIPHERAL                                  FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INIT_FLASH_IO3_SIGNAL                              FLEXSPI_A_DATA3   /*!< FLEXSPI signal: FLEXSPI_A_DATA3 */

/* GPIO_SD_B1_05 (coord N3), DQS */
#define BOARD_INIT_FLASH_DQS_PERIPHERAL                                  FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INIT_FLASH_DQS_SIGNAL                                FLEXSPI_A_DQS   /*!< FLEXSPI signal: FLEXSPI_A_DQS */

/* GPIO_SD_B1_07 (coord L4), CLK */
#define BOARD_INIT_FLASH_CLK_PERIPHERAL                                  FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INIT_FLASH_CLK_SIGNAL                               FLEXSPI_A_SCLK   /*!< FLEXSPI signal: FLEXSPI_A_SCLK */

/* GPIO_SD_B1_06 (coord L3), CS */
#define BOARD_INIT_FLASH_CS_PERIPHERAL                                   FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INIT_FLASH_CS_SIGNAL                               FLEXSPI_A_SS0_B   /*!< FLEXSPI signal: FLEXSPI_A_SS0_B */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_Flash(void);

/* GPIO_SD_B0_04 (coord H2), DAT2 */
#define BOARD_INIT_SD_DAT2_PERIPHERAL                                     USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INIT_SD_DAT2_SIGNAL                                     usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INIT_SD_DAT2_CHANNEL                                            2U   /*!< USDHC1 usdhc_data channel: 2 */

