SensorLogicInc/modules/slmx4_projects/vcom_xep_matlab_server/board/pin_mux.h
/* GPIO_SD_B0_05 (coord J2), DAT3 */
#define BOARD_INIT_SD_DAT3_PERIPHERAL                                     USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INIT_SD_DAT3_SIGNAL                                     usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INIT_SD_DAT3_CHANNEL                                            3U   /*!< USDHC1 usdhc_data channel: 3 */

/* GPIO_SD_B0_03 (coord K1), DAT1 */
#define BOARD_INIT_SD_DAT1_PERIPHERAL                                     USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INIT_SD_DAT1_SIGNAL                                     usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INIT_SD_DAT1_CHANNEL                                            1U   /*!< USDHC1 usdhc_data channel: 1 */

/* GPIO_SD_B0_02 (coord J1), DAT0 */
#define BOARD_INIT_SD_DAT0_PERIPHERAL                                     USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INIT_SD_DAT0_SIGNAL                                     usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INIT_SD_DAT0_CHANNEL                                            0U   /*!< USDHC1 usdhc_data channel: 0 */

/* GPIO_SD_B0_01 (coord J3), CLK */
#define BOARD_INIT_SD_CLK_PERIPHERAL                                      USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INIT_SD_CLK_SIGNAL                                       usdhc_clk   /*!< USDHC1 signal: usdhc_clk */

/* GPIO_SD_B0_00 (coord J4), CMD */
#define BOARD_INIT_SD_CMD_PERIPHERAL                                      USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INIT_SD_CMD_SIGNAL                                       usdhc_cmd   /*!< USDHC1 signal: usdhc_cmd */

/* GPIO_B1_12 (coord D13), CD */
#define BOARD_INIT_SD_CD_GPIO                                              GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INIT_SD_CD_PORT                                              GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INIT_SD_CD_PIN                                                 28U   /*!< GPIO2 pin index: 28 */

/* GPIO_AD_B1_10 (coord L13), SD_PWR_EN */
#define BOARD_INIT_SD_SD_PWR_EN_GPIO                                       GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INIT_SD_SD_PWR_EN_PORT                                       GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INIT_SD_SD_PWR_EN_PIN                                          26U   /*!< GPIO1 pin index: 26 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_SD(void);

/* GPIO_AD_B0_14 (coord H14), BT_UART_CTS */
#define BOARD_INIT_WICED_BT_UART_CTS_PERIPHERAL                          LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INIT_WICED_BT_UART_CTS_SIGNAL                                CTS_B   /*!< LPUART1 signal: CTS_B */

/* GPIO_AD_B0_15 (coord L10), BT_UART_RTS */
#define BOARD_INIT_WICED_BT_UART_RTS_PERIPHERAL                          LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INIT_WICED_BT_UART_RTS_SIGNAL                                RTS_B   /*!< LPUART1 signal: RTS_B */

/* GPIO_AD_B0_13 (coord L14), BT_UART_TXD */
#define BOARD_INIT_WICED_BT_UART_TXD_PERIPHERAL                          LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INIT_WICED_BT_UART_TXD_SIGNAL                                   RX   /*!< LPUART1 signal: RX */

/* GPIO_AD_B0_12 (coord K14), BT_UART_RXD */
#define BOARD_INIT_WICED_BT_UART_RXD_PERIPHERAL                          LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INIT_WICED_BT_UART_RXD_SIGNAL                                   TX   /*!< LPUART1 signal: TX */

/* GPIO_B1_09 (coord A13), WL_REG_ON */
#define BOARD_INIT_WICED_WL_REG_ON_GPIO                                    GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INIT_WICED_WL_REG_ON_PORT                                    GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INIT_WICED_WL_REG_ON_PIN                                       25U   /*!< GPIO2 pin index: 25 */

/* GPIO_B1_10 (coord B13), BT_REG_ON */
#define BOARD_INIT_WICED_BT_REG_ON_GPIO                                    GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INIT_WICED_BT_REG_ON_PORT                                    GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INIT_WICED_BT_REG_ON_PIN                                       26U   /*!< GPIO2 pin index: 26 */

/* GPIO_B1_07 (coord B12), BT_HOSTWAKE */
#define BOARD_INIT_WICED_BT_HOSTWAKE_GPIO                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INIT_WICED_BT_HOSTWAKE_PORT                                  GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INIT_WICED_BT_HOSTWAKE_PIN                                     23U   /*!< GPIO2 pin index: 23 */

/* GPIO_B1_11 (coord C13), WIFI_GPIO2 */
#define BOARD_INIT_WICED_WIFI_GPIO2_GPIO                                   GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INIT_WICED_WIFI_GPIO2_PORT                                   GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INIT_WICED_WIFI_GPIO2_PIN                                      27U   /*!< GPIO2 pin index: 27 */

/* GPIO_B1_14 (coord C14), WIFI_GPIO3 */
#define BOARD_INIT_WICED_WIFI_GPIO3_GPIO                                   GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INIT_WICED_WIFI_GPIO3_PORT                                   GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INIT_WICED_WIFI_GPIO3_PIN                                      30U   /*!< GPIO2 pin index: 30 */

/* GPIO_AD_B1_15 (coord J14), BT_WAKE */
#define BOARD_INIT_WICED_BT_WAKE_GPIO                                      GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INIT_WICED_BT_WAKE_PORT                                      GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INIT_WICED_BT_WAKE_PIN                                         31U   /*!< GPIO1 pin index: 31 */

/* GPIO_AD_B1_09 (coord M13), WIFI_SDIO_CLK */
#define BOARD_INIT_WICED_WIFI_SDIO_CLK_PERIPHERAL                         USDHC2   /*!< Device name: USDHC2 */
#define BOARD_INIT_WICED_WIFI_SDIO_CLK_SIGNAL                          usdhc_clk   /*!< USDHC2 signal: usdhc_clk */

/* GPIO_AD_B1_08 (coord H13), WIFI_SDIO_CMD */
#define BOARD_INIT_WICED_WIFI_SDIO_CMD_PERIPHERAL                         USDHC2   /*!< Device name: USDHC2 */
#define BOARD_INIT_WICED_WIFI_SDIO_CMD_SIGNAL                          usdhc_cmd   /*!< USDHC2 signal: usdhc_cmd */

/* GPIO_AD_B1_04 (coord L12), WIDI_SDIO_D0 */
#define BOARD_INIT_WICED_WIDI_SDIO_D0_PERIPHERAL                          USDHC2   /*!< Device name: USDHC2 */
#define BOARD_INIT_WICED_WIDI_SDIO_D0_SIGNAL                          usdhc_data   /*!< USDHC2 signal: usdhc_data */
#define BOARD_INIT_WICED_WIDI_SDIO_D0_CHANNEL                                 0U   /*!< USDHC2 usdhc_data channel: 0 */

/* GPIO_AD_B1_05 (coord K12), WIDI_SDIO_D1 */
#define BOARD_INIT_WICED_WIDI_SDIO_D1_PERIPHERAL                          USDHC2   /*!< Device name: USDHC2 */
#define BOARD_INIT_WICED_WIDI_SDIO_D1_SIGNAL                          usdhc_data   /*!< USDHC2 signal: usdhc_data */
#define BOARD_INIT_WICED_WIDI_SDIO_D1_CHANNEL                                 1U   /*!< USDHC2 usdhc_data channel: 1 */

/* GPIO_AD_B1_06 (coord J12), WIDI_SDIO_D2 */
#define BOARD_INIT_WICED_WIDI_SDIO_D2_PERIPHERAL                          USDHC2   /*!< Device name: USDHC2 */
#define BOARD_INIT_WICED_WIDI_SDIO_D2_SIGNAL                          usdhc_data   /*!< USDHC2 signal: usdhc_data */
#define BOARD_INIT_WICED_WIDI_SDIO_D2_CHANNEL                                 2U   /*!< USDHC2 usdhc_data channel: 2 */

/* GPIO_AD_B1_07 (coord K10), WIDI_SDIO_D3 */
#define BOARD_INIT_WICED_WIDI_SDIO_D3_PERIPHERAL                          USDHC2   /*!< Device name: USDHC2 */
#define BOARD_INIT_WICED_WIDI_SDIO_D3_SIGNAL                          usdhc_data   /*!< USDHC2 signal: usdhc_data */
#define BOARD_INIT_WICED_WIDI_SDIO_D3_CHANNEL                                 3U   /*!< USDHC2 usdhc_data channel: 3 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_Wiced(void);

/* USB_OTG1_DN (coord M8), DM */
#define BOARD_INIT_USB_DM_PERIPHERAL                                        USB1   /*!< Device name: USB1 */
#define BOARD_INIT_USB_DM_SIGNAL                                     usb_otg1_dn   /*!< USB1 signal: usb_otg1_dn */

/* USB_OTG1_DP (coord L8), DP */
#define BOARD_INIT_USB_DP_PERIPHERAL                                        USB1   /*!< Device name: USB1 */
#define BOARD_INIT_USB_DP_SIGNAL                                     usb_otg1_dp   /*!< USB1 signal: usb_otg1_dp */

/* GPIO_AD_B0_01 (coord H10), ID */
#define BOARD_INIT_USB_ID_PERIPHERAL                                        USB1   /*!< Device name: USB1 */
#define BOARD_INIT_USB_ID_SIGNAL                                     usb_otg1_id   /*!< USB1 signal: usb_otg1_id */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_USB(void);

