SensorLogicInc/modules/slmx4_projects/vcom_xep_matlab_server/board/pin_mux.h
/* GPIO_AD_B0_02 (coord M11), RED */
#define BOARD_INIT_LED_RED_GPIO                                            GPIO6   /*!< GPIO device name: GPIO6 */
#define BOARD_INIT_LED_RED_PORT                                            GPIO6   /*!< PORT device name: GPIO6 */
#define BOARD_INIT_LED_RED_PIN                                                2U   /*!< GPIO6 pin index: 2 */

/* GPIO_AD_B0_03 (coord G11), GREEN */
#define BOARD_INIT_LED_GREEN_GPIO                                          GPIO6   /*!< GPIO device name: GPIO6 */
#define BOARD_INIT_LED_GREEN_PORT                                          GPIO6   /*!< PORT device name: GPIO6 */
#define BOARD_INIT_LED_GREEN_PIN                                              3U   /*!< GPIO6 pin index: 3 */

/* GPIO_B0_11 (coord A10), PWMG */
#define BOARD_INIT_LED_PWMG_PERIPHERAL                                      PWM2   /*!< Device name: PWM2 */
#define BOARD_INIT_LED_PWMG_SIGNAL                                             B   /*!< PWM2 signal: B */
#define BOARD_INIT_LED_PWMG_CHANNEL                                           2U   /*!< PWM2 B channel: 2 */

/* GPIO_B0_09 (coord C9), PWMB */
#define BOARD_INIT_LED_PWMB_PERIPHERAL                                      PWM2   /*!< Device name: PWM2 */
#define BOARD_INIT_LED_PWMB_SIGNAL                                             B   /*!< PWM2 signal: B */
#define BOARD_INIT_LED_PWMB_CHANNEL                                           1U   /*!< PWM2 B channel: 1 */

/* GPIO_B0_07 (coord A9), PWMR */
#define BOARD_INIT_LED_PWMR_PERIPHERAL                                      PWM2   /*!< Device name: PWM2 */
#define BOARD_INIT_LED_PWMR_SIGNAL                                             B   /*!< PWM2 signal: B */
#define BOARD_INIT_LED_PWMR_CHANNEL                                           0U   /*!< PWM2 B channel: 0 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_LED(void);

/* GPIO_AD_B0_11 (coord G10), TRST */
#define BOARD_INIT_JTAG_TRST_PERIPHERAL                                     JTAG   /*!< Device name: JTAG */
#define BOARD_INIT_JTAG_TRST_SIGNAL                                        TRSTB   /*!< JTAG signal: TRSTB */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_JTAG(void);

/* GPIO_B0_01 (coord E7), SPI_MISO */
#define BOARD_INIT_X4_SPI_MISO_PERIPHERAL                                 LPSPI4   /*!< Device name: LPSPI4 */
#define BOARD_INIT_X4_SPI_MISO_SIGNAL                                        SDI   /*!< LPSPI4 signal: SDI */

/* GPIO_B0_03 (coord D8), SPI_SCLK */
#define BOARD_INIT_X4_SPI_SCLK_PERIPHERAL                                 LPSPI4   /*!< Device name: LPSPI4 */
#define BOARD_INIT_X4_SPI_SCLK_SIGNAL                                        SCK   /*!< LPSPI4 signal: SCK */

/* GPIO_B0_00 (coord D7), SPI_CS */
#define BOARD_INIT_X4_SPI_CS_PERIPHERAL                                   LPSPI4   /*!< Device name: LPSPI4 */
#define BOARD_INIT_X4_SPI_CS_SIGNAL                                         PCS0   /*!< LPSPI4 signal: PCS0 */

/* GPIO_B0_02 (coord E8), SPI_MOSI */
#define BOARD_INIT_X4_SPI_MOSI_PERIPHERAL                                 LPSPI4   /*!< Device name: LPSPI4 */
#define BOARD_INIT_X4_SPI_MOSI_SIGNAL                                        SDO   /*!< LPSPI4 signal: SDO */

/* GPIO_B0_06 (coord A8), EN */
#define BOARD_INIT_X4_EN_GPIO                                              GPIO7   /*!< GPIO device name: GPIO7 */
#define BOARD_INIT_X4_EN_PORT                                              GPIO7   /*!< PORT device name: GPIO7 */
#define BOARD_INIT_X4_EN_PIN                                                  6U   /*!< GPIO7 pin index: 6 */

/* GPIO_B0_04 (coord C8), GPIO1 */
#define BOARD_INIT_X4_GPIO1_GPIO                                           GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INIT_X4_GPIO1_PORT                                           GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INIT_X4_GPIO1_PIN                                               4U   /*!< GPIO2 pin index: 4 */

/* GPIO_B0_05 (coord B8), GPIO2 */
#define BOARD_INIT_X4_GPIO2_GPIO                                           GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INIT_X4_GPIO2_PORT                                           GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INIT_X4_GPIO2_PIN                                               5U   /*!< GPIO2 pin index: 5 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_X4(void);

/* GPIO_AD_B1_00 (coord J11), SCL */
#define BOARD_INIT_I2C_SCL_PERIPHERAL                                     LPI2C1   /*!< Device name: LPI2C1 */
#define BOARD_INIT_I2C_SCL_SIGNAL                                            SCL   /*!< LPI2C1 signal: SCL */

/* GPIO_AD_B1_01 (coord K11), SDA */
#define BOARD_INIT_I2C_SDA_PERIPHERAL                                     LPI2C1   /*!< Device name: LPI2C1 */
#define BOARD_INIT_I2C_SDA_SIGNAL                                            SDA   /*!< LPI2C1 signal: SDA */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_I2C(void);

/* GPIO_AD_B1_02 (coord L11), UART2_TX */
#define BOARD_INIT_UART_UART2_TX_PERIPHERAL                              LPUART2   /*!< Device name: LPUART2 */
#define BOARD_INIT_UART_UART2_TX_SIGNAL                                       TX   /*!< LPUART2 signal: TX */

/* GPIO_AD_B1_03 (coord M12), UART2_RX */
#define BOARD_INIT_UART_UART2_RX_PERIPHERAL                              LPUART2   /*!< Device name: LPUART2 */
#define BOARD_INIT_UART_UART2_RX_SIGNAL                                       RX   /*!< LPUART2 signal: RX */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_UART(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
